performance/Echo/results/edge-n100-row-1.txt
This is ApacheBench, Version 2.3 <$Revision: 1373084 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /edge
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   0.049 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      10100 bytes
Total body sent:        37800
HTML transferred:       0 bytes
Requests per second:    2048.80 [#/sec] (mean)
Time per request:       0.488 [ms] (mean)
Time per request:       0.488 [ms] (mean, across all concurrent requests)
Transfer rate:          202.08 [Kbytes/sec] received
                        756.30 kb/s sent
                        958.38 kb/s total

Connection Times (ms)
              min   avg   max
Connect:        0     0    1
Processing:     0     0    0
Total:          0     0    1