performance/Echo/results/edge-n100-row-10.txt
This is ApacheBench, Version 2.3 <$Revision: 1373084 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /edge
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   0.068 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      10100 bytes
Total body sent:        266900
HTML transferred:       0 bytes
Requests per second:    1463.70 [#/sec] (mean)
Time per request:       0.683 [ms] (mean)
Time per request:       0.683 [ms] (mean, across all concurrent requests)
Transfer rate:          144.37 [Kbytes/sec] received
                        3815.05 kb/s sent
                        3959.42 kb/s total

Connection Times (ms)
              min   avg   max
Connect:        0     0    1
Processing:     0     1    0
Total:          0     1    1