performance/Echo/results/edge-n1000-row-100.txt
This is ApacheBench, Version 2.3 <$Revision: 1373084 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /edge
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   3.049 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      101000 bytes
Total body sent:        25283000
HTML transferred:       0 bytes
Requests per second:    327.97 [#/sec] (mean)
Time per request:       3.049 [ms] (mean)
Time per request:       3.049 [ms] (mean, across all concurrent requests)
Transfer rate:          32.35 [Kbytes/sec] received
                        8097.78 kb/s sent
                        8130.13 kb/s total

Connection Times (ms)
              min   avg   max
Connect:        0     0    1
Processing:     2     3    6
Total:          2     3    7