performance/Echo/results/node-n100-row-10.txt
This is ApacheBench, Version 2.3 <$Revision: 1373084 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /node
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   0.063 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      10100 bytes
Total body sent:        266900
HTML transferred:       0 bytes
Requests per second:    1576.32 [#/sec] (mean)
Time per request:       0.634 [ms] (mean)
Time per request:       0.634 [ms] (mean, across all concurrent requests)
Transfer rate:          155.48 [Kbytes/sec] received
                        4108.59 kb/s sent
                        4264.06 kb/s total

Connection Times (ms)
              min   avg   max
Connect:        0     0    1
Processing:     0     1   11
Total:          0     1   12