performance/Echo/results/node-n100-row-100.txt
This is ApacheBench, Version 2.3 <$Revision: 1373084 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /node
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   0.097 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      10100 bytes
Total body sent:        2528300
HTML transferred:       0 bytes
Requests per second:    1035.03 [#/sec] (mean)
Time per request:       0.966 [ms] (mean)
Time per request:       0.966 [ms] (mean, across all concurrent requests)
Transfer rate:          102.09 [Kbytes/sec] received
                        25555.22 kb/s sent
                        25657.31 kb/s total

Connection Times (ms)
              min   avg   max
Connect:        0     0    1
Processing:     0     1    5
Total:          0     1    6