performance/Echo/results/node-n10000-row-1.txt
This is ApacheBench, Version 2.3 <$Revision: 1373084 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /node
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   3.980 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      1010000 bytes
Total body sent:        3780000
HTML transferred:       0 bytes
Requests per second:    2512.48 [#/sec] (mean)
Time per request:       0.398 [ms] (mean)
Time per request:       0.398 [ms] (mean, across all concurrent requests)
Transfer rate:          247.81 [Kbytes/sec] received
                        927.46 kb/s sent
                        1175.27 kb/s total

Connection Times (ms)
              min   avg   max
Connect:        0     0    1
Processing:     0     0   11
Total:          0     0   12